Revit 2027 API
PropertyLine.Create Method
Overload List
Name | Description
Create(Document, IList<CurveLoop>) |  Creates a new Property element with input CurveLoops and adds it to the document.
Create(Document, IList<PropertyTableEntry>) |  Creates a new PropertyLine element from property table and adds it to the document.
Top
See Also
Reference
PropertyLine Class
Autodesk.Revit.DB Namespace